# MassFloorAreaLevels Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..MassFloorAreaLevels Property
ParameterTypeId Class See Also
---
"Mass Floors"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId MassFloorAreaLevels { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MassFloorAreaLevels As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MassFloorAreaLevels {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace